src/test/resources/getAllDict.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ehd="http://ehd.mos.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ehd:getAllDict/>
    </soapenv:Body>
</soapenv:Envelope>